# Домашнее задание к работе 13

## Условие задачи
Составить программу, которая во введенной пользователем строке определяет, сколько 
в заданном предложении слов, начинающихся с буквы,
заданной пользователем.


## 1. Алгоритм и блок-схема

### Алгоритм
1. **Начало**
2. Задать исходные данные:
   - `Predl[100]` — массив для заполнения текстом.
   - `letter` — буква, по которой будем считать слова
   - `count_words` — счетчик найденных слов
4. Вывести результат поиска слов в тексте
5. **Конец**

### Блок-схема

 



## 2. Реализация программы
    #include <stdio.h>
    #include <string.h>
    #include <ctype.h>
    #include <locale.h>
    #define _CRT_SECURE_NO_DEPRECATE 
    void task();
    main() {
    	setlocale(LC_CTYPE, "RUS");
    	task();
    }
    void task() {
    	do {
    		char Predl[100], letter;
    		int count_words = 0;
    		printf("Ваше предложение:\n");
    		fgets(Predl, 100, stdin);
    		printf("Введите букву:\n");
    		scanf(" %c", &letter);

		for (int i = 0; Predl[i] != '\0'; i++)
			if ((i == 0 || Predl[i - 1] == ' ') && Predl[i] == letter) count_words++;
		printf("В предложении %d слов(а), начинающихся с %c\n", count_words, letter);
		printf("Продолжить ? (Да - любая клавиша, нет - n)\n");
		char a;
		getchar();
		if (a = getchar() == 'n') break;
	} while (1);
    }
## 3. Результаты работы программы

Ваше предложение:
Я пришел домой до дома скоро
Введите букву:
д
В предложении 3 слов(а), начинающихся с д
Продолжить ? (Да - любая клавиша, нет - n)
## 4. Информация о разработчике

Землянухин Артём бИЦ-252
